CSI API ETABS v1
cOptions Interface
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
public interface cOptions
Public Interface cOptions
Dim instance As cOptions
public interface class cOptions
type cOptions =  interface end
The cOptions type exposes the following members.
Methods
Name | Description
GetDefaultFunctionFolder
 Returns the default folder to (recursively) search if a function data file is not found in the specified path or in the model folder. This is a global setting for the user and applies to all models.
SetDefaultFunctionFolder
 Sets the default folder to (recursively) search if a function data file is not found in the specified path or in the model folder. This is a global setting for the user and applies to all models.
Top
See Also
Reference
ETABSv1 Namespace